First_Routes_Controllers/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 3], ["created_at", "2021-04-01 16:07:24.305158"], ["updated_at", "2021-04-01 16:07:24.305158"]]
---
    def create
        artwork_shares = ArtworkShare.new(artwork_share_params)
        if artwork_shares.save