First_Routes_Controllers/app/controllers/artworks_controller.rb

    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save
---
INSERT INTO "artworks" ("title", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hahaha"], ["img_url", "laskdjf"], ["created_at", "2021-04-01 15:39:02.678808"], ["updated_at", "2021-04-01 15:39:02.678808"]]